src/cf/InformationRegisters/инт_ОчередьОтправкиИсходящихСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>инт_ОчередьОтправкиИсходящихСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СформированноеСообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подписчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.инт_Подписчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/инт_ИсторияСтатусовРассылкиСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>инт_ИсторияСтатусовРассылкиСообщений</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.инт_СтатусыРассылкиИсходящихСообщений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подписчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.инт_Подписчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/инт_ТекущийСтатусРассылкиСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>инт_ТекущийСтатусРассылкиСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.инт_СтатусыРассылкиИсходящихСообщений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСледующейПопытки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подписчик</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.инт_Подписчик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/инт_СтатусыРассылкиИсходящихСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>инт_СтатусыРассылкиИсходящихСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сформирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаОбработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПроцессеОтправки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/инт_ОчередьОтправкиИсходящихСообщений/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписьРСТекущийСтатус = ПолучитьТекущийСтатусПоКлючу(Параметры.Ключ);
	ЗначениеВРеквизитФормы(ЗаписьРСТекущийСтатус, "ЗаписьРСТекущийСтатусРассылки");
																		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИзменитьСтатус(Команда)
			
	ОткрытьФорму("Перечисление.инт_СтатусыРассылкиИсходящихСообщений.ФормаВыбора",,,,,,
				Новый ОписаниеОповещения("ИзменитьСтатусЗавершение", ЭтотОбъект));
									
КонецПроцедуры
			
&НаКлиенте
Процедура ИсторияСтатусов(Команда)
		
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ИдентификаторСообщения", Запись.ИдентификаторСообщения);
	ПараметрыОтбора.Вставить("Подписчик", Запись.Подписчик);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	
	ОткрытьФорму("РегистрСведений.инт_ИсторияСтатусовРассылкиСообщений.ФормаСписка", ПараметрыФормы, ЭтотОбъект);
		
КонецПроцедуры
			
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьТекущийСтатусПоКлючу(КлючЗаписи)
		
	МенеджерЗаписи = РегистрыСведений.инт_ТекущийСтатусРассылкиСообщений.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, КлючЗаписи);
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		Возврат МенеджерЗаписи;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ИзменитьСтатусНаСервере(Статус, ИдентификаторСообщения, Подписчик, ТекстОшибки)
		
    РегистрыСведений.инт_ТекущийСтатусРассылкиСообщений.ЗаписатьСтатусСообщения(
		ИдентификаторСообщения, Подписчик, Статус, ТекстОшибки);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВернутьСообщениеВОчередьНаСервере(ИдентификаторСообщения, Подписчик)

	РегистрыСведений.инт_ТекущийСтатусРассылкиСообщений.ВернутьСообщениеВОчередьОператором(
		ИдентификаторСообщения, Подписчик);

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСтатусЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт

	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ВыбранныйЭлемент = ПредопределенноеЗначение("Перечисление.инт_СтатусыРассылкиИсходящихСообщений.Новый") Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ВернутьСообщениеВОчередьЗавершение", ЭтотОбъект),
			"Возврат сообщения в статус ""Новый"" сбрасывает счётчик выполненных попыток:
			|подсистема начнёт отсчёт попыток заново. Продолжить?",
			РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
		Возврат;
	КонецЕсли;

	ИзменитьСтатусНаСервере(ВыбранныйЭлемент,
							Запись.ИдентификаторСообщения,
							Запись.Подписчик,
							ЗаписьРСТекущийСтатусРассылки.ТекстОшибки);

	ОбновитьСтатусНаФорме();

КонецПроцедуры

&НаКлиенте
Процедура ВернутьСообщениеВОчередьЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;

	ВернутьСообщениеВОчередьНаСервере(Запись.ИдентификаторСообщения, Запись.Подписчик);
	ОбновитьСтатусНаФорме();

КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатусНаФорме()
	
	КлючЗаписи = Новый Структура("ИдентификаторСообщения, Подписчик",
								 Запись.ИдентификаторСообщения,
								 Запись.Подписчик);
	ЗаписьРСТекущийСтатус = ПолучитьТекущийСтатусПоКлючу(КлючЗаписи);
	ЗначениеВРеквизитФормы(ЗаписьРСТекущийСтатус, "ЗаписьРСТекущийСтатусРассылки");
	
КонецПроцедуры

#КонецОбласти
